InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <resources>
    <name>абс_ФайлДопДанных</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДатаАктуальностиКИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_ЗаявкаНаТранспорт/абс_ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТранспорт</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактыОтветственногоМенеджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиКонтрагента</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМоноПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТКНазначения</name>
    <comment>Транспортная компания назначения</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПромежуточный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМиксПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CommonModules/абс_ТранспортнаяЛогистика/Module.bsl
Процедура абс_ПриЗаписиРеализацииТоваровУслугПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.абс_Статус=Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда
		СформироватьЗаявкаНаТранспорт(Источник.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьЗаявкаНаТранспорт(ДокументОтгрузки)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_ЗаявкаНаТранспорт.Ссылка
	|ИЗ
	|	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ЗаявкаНаТранспорт.ДокументОтгрузки = &ДокументОтгрузки";
	Запрос.УстановитьПараметр("ДокументОтгрузки",ДокументОтгрузки);
	Результат=Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ДокументЗаявка=Документы.абс_ЗаявкаНаТранспорт.СоздатьДокумент();
	ДокументЗаявка.Заполнить(ДокументОтгрузки);
	ДокументЗаявка.Записать();
КонецПроцедуры

Функция ПолучитьТранспортныйМаршрутПоРеализации(ДокументОтгрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОтгрузки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	абс_ТранспортныйМаршрутЗадания.Ссылка
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.ДокументОтгрузки = &ДокументОтгрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_ТранспортныйМаршрутЗадания.Ссылка.МоментВремени УБЫВ";
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументОтгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура абс_ПриУстановкеНовогоНомераТранспортногоМаршрута(Источник, СтандартнаяОбработка, Префикс) Экспорт
	Префикс = Сред(Источник.Дата,4,2) + "/" + Лев(Источник.Дата,2) + "-"
КонецПроцедуры

Процедура ЗаполнитьДанныеДляПечатиТТНВПеремещении(ПеремещениеТоваров, ТранспортныйМаршрут, ЗаявкаНаТранспорт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	абс_ТранспортныйМаршрутЗадания.Ссылка.ТКПеревозчик КАК абс_Перевозчик,
	|	абс_ТранспортныйМаршрутЗадания.Ссылка.ВодительЭкспедитор КАК абс_Водитель,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Контрагент КАК абс_Заказчик,
	|	абс_ТранспортныйМаршрутЗадания.Ссылка.НомерПломбы КАК абс_НомерПломбы,
	|	абс_ТранспортныйМаршрутЗадания.Ссылка.ТранспортноеСредство КАК абс_ТранспортноеСредство,
	|	абс_ТранспортныйМаршрутЗадания.ДатаДоставки КАК абс_СрокДоставки,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК абс_КоличествоПалет,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.АдресПромежуточный КАК абс_ПунктРазгрузки,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Склад.абс_Контрагент КАК КонтрагентСклада
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка = &ТранспортныйМаршрут
	|	И абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт";
	
	Запрос.УстановитьПараметр("ТранспортныйМаршрут", ТранспортныйМаршрут);
	Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", ЗаявкаНаТранспорт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДокументОбъект = ПеремещениеТоваров.ПолучитьОбъект();
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
		
		Если ЗначениеЗаполнено(Выборка.КонтрагентСклада) Тогда
			ДокументОбъект.абс_ПунктПогрузки = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.КонтрагентСклада, "Фактический");
		КонецЕсли;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСпособыДоставкиКонтрагентаПоАдресуДоставки(Контрагент, АдресДоставки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СпособыДоставкиКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.абс_СпособыДоставкиКонтрагентов КАК абс_СпособыДоставкиКонтрагентов
	|ГДЕ
	|	абс_СпособыДоставкиКонтрагентов.Владелец = &Контрагент
	|	И абс_СпособыДоставкиКонтрагентов.АдресДоставки = &АдресДоставки";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	
	МассивСпособовДоставки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивСпособовДоставки;
	
КонецФункции

Функция ПолучитьОсновнойАдресКонтрагента(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.ЗначениеПоУмолчанию
	|	И КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтактнаяИнформация.абс_ДатаАктуальностиКИ УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Представление);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


   ///Leo   01.04.16 Никитин добавлена функция
Функция ПолучитьФактическийАдресКонтрагента(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = &Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтактнаяИнформация.абс_ДатаАктуальностиКИ УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Вид", справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Представление);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

   ///Leo   08.02.22 Никитин добавлена функция
Функция ПолучитьДоставкиАдресКонтрагента(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = &Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтактнаяИнформация.абс_ДатаАктуальностиКИ УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Вид", справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Представление);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
